{
  "studyId": "phs000209",
  "studyName": "Multi-Ethnic Study of Atherosclerosis (MESA)",
  "rules": [
    {
      "match": { "tableName": "(?i)Lung(CT|Exam)" },
      "measure": "lung-ct-imaging",
      "domain": "Pulmonary",
      "rationale": "MESA Lung ancillary CT imaging datasets. Table names contain 'LungCT' or 'LungExam'. ~1900 vars each, covering quantitative CT measures of lung structure.",
      "description": "e.g. 'MESA Lung Ancillary Study Exam 1 Dataset: This dataset provides Exam 1 quantitative lung CT imaging data'"
    },
    {
      "match": { "tableName": "(?i)LungAirway" },
      "measure": "lung-ct-imaging",
      "domain": "Pulmonary",
      "rationale": "Lung airway measurements from CT scans. Separate from main LungCT tables, these focus on airway dimensions.",
      "description": "e.g. 'MESA Lung Airway Ancillary Study Exam 1 Dataset: This dataset provides airway data'"
    },
    {
      "match": { "tableName": "(?i)ECG" },
      "measure": "electrocardiography",
      "domain": "Cardiovascular",
      "rationale": "MESA Exam 1 continuous waveform ECG dataset, 574 vars.",
      "description": "'MESA Continuous wave ECG Dataset: This dataset provides ECG measurements'"
    },
    {
      "match": { "tableName": "(?i)Spirometry" },
      "measure": "spirometry",
      "domain": "Pulmonary",
      "rationale": "Lung function spirometry datasets from MESA Lung, Air NR, and Family ancillary studies. ~177-182 vars each.",
      "description": "e.g. 'MESA Lung Spirometry Dataset: The MESA Lung Spirometry Exam provides pulmonary function measures'"
    },
    {
      "match": { "tableName": "(?i)IMT" },
      "measure": "carotid-ultrasound",
      "domain": "Cardiovascular",
      "rationale": "IMT = Intima-Media Thickness. Carotid ultrasound measurement of arterial wall thickness, a subclinical atherosclerosis marker. 173 vars.",
      "description": "'MESA Air New Recruit Intima-Media Thickness (IMT) Dataset: This dataset provides carotid IMT measures'"
    },
    {
      "match": { "tableName": "(?i)RetinalPhoto" },
      "measure": "retinal-imaging",
      "domain": "Ophthalmology",
      "rationale": "Retinal photography from the MESA Eye ancillary study. Exam 2 and Exam 5 datasets, ~198 vars each.",
      "description": "'MESA Eye Ancillary Study Dataset: This dataset provides Exam 2/5 retinal photography data'"
    },
    {
      "match": { "tableName": "(?i)BodyCompCT" },
      "measure": "body-composition-ct",
      "domain": "Anthropometry",
      "rationale": "Abdominal body composition measured from CT scans — visceral and subcutaneous adipose tissue areas. Note: the sibling table 'AbdBodyComposition' (without 'CT') contains serum biomarkers, not CT data.",
      "description": "'MESA Ancillary Study Dataset: MESA Classic CT measures of Abdominal Body Composition'"
    },
    {
      "match": { "tableName": "(?i)(AbdominalAortic|AorticValvular|Calcium)CT" },
      "measure": "vascular-ct-imaging",
      "domain": "Cardiovascular",
      "rationale": "CT-based vascular calcification measurements: aortic calcification, aortic valve calcification, and coronary artery calcium scores.",
      "description": "e.g. 'MESA Exam 4 Abdominal Aortic CT Ancillary Dataset: The MESA Exam 4 dataset provides aortic calcification CT measures'"
    },
    {
      "match": { "tableName": "(?i)AorticValvularCalcium$" },
      "measure": "vascular-ct-imaging",
      "domain": "Cardiovascular",
      "rationale": "Aortic valvular calcium score datasets without the 'CT' suffix in the name.",
      "description": "'MESA Classic Aortic Valvular Calcium Dataset: This dataset contains aortic valve calcium measures'"
    },
    {
      "match": { "tableName": "(?i)PericardialFat" },
      "measure": "vascular-ct-imaging",
      "domain": "Cardiovascular",
      "rationale": "Pericardial fat volume measured from cardiac CT scans, a marker of cardiovascular risk.",
      "description": "'MESA Pericardial Fat Dataset: This is an ancillary study dataset with pericardial fat measures'"
    },
    {
      "match": { "tableName": "(?i)AirExposure" },
      "measure": "air-pollution-exposure",
      "domain": "Environmental",
      "rationale": "Air pollution exposure estimates from the MESA Air ancillary study, for MESA classic, Air NR, and Family cohorts.",
      "description": "'MESA Air Ancillary Study MESA Exposure Dataset: This dataset provides estimates of individual-level air pollution exposure'"
    },
    {
      "match": { "tableName": "(?i)Sleep|Polysomnography" },
      "measure": "polysomnography",
      "domain": "Sleep",
      "rationale": "MESA Sleep ancillary study — overnight polysomnography recordings from Exam 5.",
      "description": "'MESA Sleep Ancillary Study Dataset from Exam 5'"
    },
    {
      "match": { "tableName": "(?i)NAFLD|LiverCT" },
      "measure": "liver-ct-imaging",
      "domain": "Hepatology",
      "rationale": "NAFLD = Non-Alcoholic Fatty Liver Disease. Liver CT measurements for hepatic steatosis quantification.",
      "description": "'MESA Non-Alcoholic Fatty Liver Disease (NAFLD) Liver CT Dataset'"
    },
    {
      "match": { "tableName": "(?i)BMD" },
      "measure": "bone-mineral-density",
      "domain": "Musculoskeletal",
      "rationale": "BMD = Bone Mineral Density. MESA ancillary study measuring DXA-derived bone density.",
      "description": "'MESA Ancillary Study Dataset: MESA Classic measures of bone mineral density'"
    },
    {
      "match": { "tableName": "(?i)FMD" },
      "measure": "flow-mediated-dilation",
      "domain": "Cardiovascular",
      "rationale": "FMD = Flow-Mediated Dilation. Brachial artery ultrasound measure of endothelial function.",
      "description": "'MESA Flow Mediated Dilation (FMD) Dataset: This is an ancillary study dataset with FMD measures'"
    },
    {
      "match": { "tableName": "(?i)RVFunction" },
      "measure": "cardiac-mri",
      "domain": "Cardiovascular",
      "rationale": "Right ventricular function measured from cardiac MRI.",
      "description": "'MESA RV Function Ancillary Study Dataset. This dataset provides right ventricular function measures from cardiac MRI'"
    },
    {
      "match": { "tableName": "(?i)CTRead" },
      "measure": "lung-ct-imaging",
      "domain": "Pulmonary",
      "rationale": "CT scan reads for 185 lung case-control subjects — visual scoring of CT images.",
      "description": "'MESA Lung CT Read 185: Lung CT reads for 185 case-control subjects'"
    }
  ]
}
